Revit 2026 API

# PerformanceAdviserExecuteRules(Document, IListPerformanceAdviserRuleId) Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IList<FailureMessage> ExecuteRules(
	Document document,
	IList<PerformanceAdviserRuleId> rules
)
```
```vb
Public Function ExecuteRules (
	document As Document,
	rules As IList(Of PerformanceAdviserRuleId)
) As IList(Of FailureMessage)
```
```cpp
public:
IList<FailureMessage^>^ ExecuteRules(
	Document^ document,
	IList<PerformanceAdviserRuleId^>^ rules
)
```
```fsharp
member ExecuteRules :
        document : Document *
        rules : IList<PerformanceAdviserRuleId> -> IList<FailureMessage>
```

#### Parameters

document Document

rules IListPerformanceAdviserRuleId

#### Return Value

IListFailureMessage

#### Reference

PerformanceAdviser Class

ExecuteRules Overload

Autodesk.Revit.DB Namespace